app/views/theses/_form.html.erb

SELECT "faculties".* FROM "faculties"
---
    <%= f.label :faculty %><br>
    <%= f.select :faculty_id, Faculty.all.collect { |f| [f.name, f.id] }, include_blank: true %>